Revit 2027 API
DetailCurveArray.ReverseIterator Method
Retrieve a backward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual DetailCurveArrayIterator ReverseIterator()
Public Overridable Function ReverseIterator As DetailCurveArrayIterator
public:
virtual DetailCurveArrayIterator^ ReverseIterator()
abstract ReverseIterator : unit -> DetailCurveArrayIterator
override ReverseIterator : unit -> DetailCurveArrayIterator
Return Value
DetailCurveArrayIterator
Returns a backward moving iterator to the array.
See Also
Reference
DetailCurveArray Class
Autodesk.Revit.DB Namespace